{
	"version": "https://jsonfeed.org/version/1",
	"title": "Bandit Chronicles",
	"icon": "https://micro.blog/clintondreisbach/avatar.jpg",
	"home_page_url": "https://banditchronicles.micro.blog/",
	"feed_url": "https://banditchronicles.micro.blog/feed.json",
	"items": [
		
			{
				"id": "http://banditchronicles.micro.blog/2023/04/30/175941.html",
				
				"content_html": "<p>📻 <a href=\"https://thisiscriminal.com/episode-216-the-magdalene-laundries-4-28-2023\">thisiscriminal.com/episode-2&hellip;</a></p>\n<p>Listening to this episode of <em>Criminal</em> and blown away by the tale of these amazing boys who worked with their mom to free women and girls kept prisoner in a Catholic laundry in Galway.</p>\n",
				"content_text": "📻 [thisiscriminal.com/episode-2...](https://thisiscriminal.com/episode-216-the-magdalene-laundries-4-28-2023)\r\n\r\nListening to this episode of _Criminal_ and blown away by the tale of these amazing boys who worked with their mom to free women and girls kept prisoner in a Catholic laundry in Galway. \n",
				"date_published": "2023-04-30T13:59:41-04:00",
				"url": "https://banditchronicles.micro.blog/2023/04/30/175941.html"
			},
			{
				"id": "http://banditchronicles.micro.blog/2023/04/26/finished-reading-the.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9781635421767\">The Anomaly: A Novel</a> by Hervé Le Tellier 📚</p>\n<p>This was 100% my kind of book &ndash; it had an unexplainable event, dozens of characters, discussions of the nature of reality, and a hitman. That sounds heavy, but it was a quick read. Highly recommend, especially if you like weird fiction.</p>\n",
				"content_text": "Finished reading: [The Anomaly: A Novel](https://micro.blog/books/9781635421767) by Hervé Le Tellier 📚\r\n\r\nThis was 100% my kind of book -- it had an unexplainable event, dozens of characters, discussions of the nature of reality, and a hitman. That sounds heavy, but it was a quick read. Highly recommend, especially if you like weird fiction.\n",
				"date_published": "2023-04-26T17:27:34-04:00",
				"url": "https://banditchronicles.micro.blog/2023/04/26/finished-reading-the.html"
			},
			{
				"id": "http://banditchronicles.micro.blog/2022/11/27/tuskegee-airmen-nhs.html",
				"title": "Tuskegee Airmen NHS",
				"content_html": "<p>I went to the Tuskegee Airmen NHS (<a href=\"https://www.nps.gov/tuai/index.htm\">https://www.nps.gov/tuai/index.htm</a>) over the holiday. It is pretty much in my ancestral backyard, but I had never gone and I am so glad I did &ndash; it was a great, clear, and nuanced look at the complicated history of the training program for Black pilots held there. The Tuskegee Airmen became the first US Black military pilots and endured tremendous racism while training and upon return after WWII. There were many stories of heroism and of tragedy. The story that stuck with me was a Black pilot who had to make an emergency landing in a farmer&rsquo;s field while training. The white farmer accused him of stealing the plane and tried to run him off.</p>\n<p>Photo credits:</p>\n<p>© Pwsuddes / Wikimedia Commons / CC-BY-SA-3.0 / <a href=\"https://commons.wikimedia.org/wiki/File:Tuskegee_Airmen_NHS_Hangar_2.jpg\">https://commons.wikimedia.org/wiki/File:Tuskegee_Airmen_NHS_Hangar_2.jpg</a></p>\n<p>© Ser Amantio di Nicolaos / Wikimedia Commons / CC-BY-SA-3.0 / <a href=\"https://commons.wikimedia.org/wiki/File:Quotes,_Tuskegee_Airmen_NHS.jpg\">https://commons.wikimedia.org/wiki/File:Quotes,_Tuskegee_Airmen_NHS.jpg</a></p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "I went to the Tuskegee Airmen NHS (https://www.nps.gov/tuai/index.htm) over the holiday. It is pretty much in my ancestral backyard, but I had never gone and I am so glad I did -- it was a great, clear, and nuanced look at the complicated history of the training program for Black pilots held there. The Tuskegee Airmen became the first US Black military pilots and endured tremendous racism while training and upon return after WWII. There were many stories of heroism and of tragedy. The story that stuck with me was a Black pilot who had to make an emergency landing in a farmer's field while training. The white farmer accused him of stealing the plane and tried to run him off.\r\n\r\nPhoto credits:\r\n\r\n© Pwsuddes / Wikimedia Commons / CC-BY-SA-3.0 / https://commons.wikimedia.org/wiki/File:Tuskegee_Airmen_NHS_Hangar_2.jpg\r\n\r\n© Ser Amantio di Nicolaos / Wikimedia Commons / CC-BY-SA-3.0 / https://commons.wikimedia.org/wiki/File:Quotes,_Tuskegee_Airmen_NHS.jpg\n\n<img src=\"uploads/2022/4f320dbfb1.jpg\" width=\"600\" height=\"450\" alt=\"A red-tail P-51 Mustang suspended from the ceiling in a museum.\"><img src=\"uploads/2022/056b84a355.jpg\" width=\"450\" height=\"600\" alt=\"A museum display with the quote &quot;You volunteer to fight for a country that lynched your people. Why?&quot; from an SS officer to an American Black POW, CPT Luther H. Smith, Jr.\">\n",
				"date_published": "2022-11-27T11:41:39-04:00",
				"url": "https://banditchronicles.micro.blog/2022/11/27/tuskegee-airmen-nhs.html"
			},
			{
				"id": "http://banditchronicles.micro.blog/2022/11/11/i-still-feel.html",
				
				"content_html": "<p>I still feel a little conflicted about my time in the Army, but I don&rsquo;t feel conflicted about how silly this very skinny and beardless version of me from 1998 looks. The Korean soldiers in this photo and I were about to have the wildest night of my life.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I still feel a little conflicted about my time in the Army, but I don't feel conflicted about how silly this very skinny and beardless version of me from 1998 looks. The Korean soldiers in this photo and I were about to have the wildest night of my life.\n\n<img src=\"uploads/2022/070be26636.jpg\" width=\"600\" height=\"449\" alt=\"Eight soldiers, 6 Korean, 1 me, and 1 a random American\">\n",
				"date_published": "2022-11-11T16:48:39-04:00",
				"url": "https://banditchronicles.micro.blog/2022/11/11/i-still-feel.html"
			},
			{
				"id": "http://banditchronicles.micro.blog/2022/11/11/veterans-day-is.html",
				"title": "Veterans' Day is complicated",
				"content_html": "<p>When I was 18, I was stuck in rural Alabama. I don&rsquo;t know why I didn&rsquo;t fit there, but I didn&rsquo;t, and my situation wasn&rsquo;t going very well. I was starting to have a breakdown and so I drove an hour to an Army recruitment office and joined without telling anyone first. When you are in a pit, you grab the first rope.</p>\n<p>People told me I made a mistake &ndash; that it would be too hard for me. I did it anyway and it woke me up. I went from living in the middle of nowhere to living in California, going to SF or Santa Cruz every chance I got, to living in South Korea with my roommate from Guam. I met my first (semi-)out queer people. I partied with a bunch of Korean soldiers and accidentally got a room in something called a &ldquo;love hotel.&rdquo;</p>\n<p>I also made a lot of mistakes, dozens upon dozens, and didn&rsquo;t take the time to see that I was a part of a system of violence and power. I started to realize that later and have particularly become aware of it while on my path to faith. I still struggle with it &ndash; I am a committed pacifist but I am proud of my service.</p>\n<p>I&rsquo;m taking the day off tomorrow. I&rsquo;m looking forward to the three-day weekend; I hope to spend some time writing and thinking.</p>\n",
				"content_text": "When I was 18, I was stuck in rural Alabama. I don't know why I didn't fit there, but I didn't, and my situation wasn't going very well. I was starting to have a breakdown and so I drove an hour to an Army recruitment office and joined without telling anyone first. When you are in a pit, you grab the first rope.\r\n\r\nPeople told me I made a mistake -- that it would be too hard for me. I did it anyway and it woke me up. I went from living in the middle of nowhere to living in California, going to SF or Santa Cruz every chance I got, to living in South Korea with my roommate from Guam. I met my first (semi-)out queer people. I partied with a bunch of Korean soldiers and accidentally got a room in something called a \"love hotel.\"\r\n\r\nI also made a lot of mistakes, dozens upon dozens, and didn't take the time to see that I was a part of a system of violence and power. I started to realize that later and have particularly become aware of it while on my path to faith. I still struggle with it -- I am a committed pacifist but I am proud of my service.\r\n\r\nI'm taking the day off tomorrow. I'm looking forward to the three-day weekend; I hope to spend some time writing and thinking.\n",
				"date_published": "2022-11-10T22:41:34-04:00",
				"url": "https://banditchronicles.micro.blog/2022/11/11/veterans-day-is.html"
			},
			{
				"id": "http://banditchronicles.micro.blog/2022/11/09/moving-to-microblog.html",
				
				"content_html": "<p>Moving to micro.blog has been such a good experience &ndash; I am <strong>certain</strong> I made the right choice. I love having ownership over my own presence, deep customization, and a familar interface but very different way of interacting. #mbnov</p>\n",
				"content_text": "Moving to micro.blog has been such a good experience -- I am **certain** I made the right choice. I love having ownership over my own presence, deep customization, and a familar interface but very different way of interacting. #mbnov\n",
				"date_published": "2022-11-09T12:07:12-04:00",
				"url": "https://banditchronicles.micro.blog/2022/11/09/moving-to-microblog.html"
			},
			{
				"id": "http://banditchronicles.micro.blog/2022/11/07/notes-from-the.html",
				"title": "Notes from the Burning Age 📚",
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780316498852\">Notes from the Burning Age</a> by Claire North 📚</p>\n<p>I picked this up on a whim &ndash; it has a great cover and sounded like it was about climate apocalypse and religion. It was, but it was so much more. I loved how richly drawn the faith of the future was drawn. The first-person narrative gave the author the chance to present faith through the eyes of a (sometimes) believer without making her own judgment on the truth of things. Highly recommended if you like cli-fi, espionage, and philosophical debates.</p>\n",
				"content_text": "Finished reading: [Notes from the Burning Age](https://micro.blog/books/9780316498852) by Claire North 📚\n\nI picked this up on a whim -- it has a great cover and sounded like it was about climate apocalypse and religion. It was, but it was so much more. I loved how richly drawn the faith of the future was drawn. The first-person narrative gave the author the chance to present faith through the eyes of a (sometimes) believer without making her own judgment on the truth of things. Highly recommended if you like cli-fi, espionage, and philosophical debates.\n",
				"date_published": "2022-11-07T19:03:17-04:00",
				"url": "https://banditchronicles.micro.blog/2022/11/07/notes-from-the.html"
			},
			{
				"id": "http://banditchronicles.micro.blog/2022/11/04/crossed-words-in.html",
				
				"content_html": "<p>Crossed 44,000 words in my novel last night. After keeping up 500 words a day for the last few months, I&rsquo;ve slipped to 200-300, but I have hope I&rsquo;ll pick back up. I did get to write an exciting scene set in a skin-scouring dust storm.</p>\n",
				"content_text": "Crossed 44,000 words in my novel last night. After keeping up 500 words a day for the last few months, I've slipped to 200-300, but I have hope I'll pick back up. I did get to write an exciting scene set in a skin-scouring dust storm.\n",
				"date_published": "2022-11-04T13:01:06-04:00",
				"url": "https://banditchronicles.micro.blog/2022/11/04/crossed-words-in.html"
			},
			{
				"id": "http://banditchronicles.micro.blog/2022/11/03/my-first-microblog.html",
				
				"content_html": "<p>My first micro.blog post! Explanation of the username: it&rsquo;s an exact anagram of my name and also the title of the book series I&rsquo;m writing.</p>\n",
				"content_text": "My first micro.blog post! Explanation of the username: it's an exact anagram of my name and also the title of the book series I'm writing.\n",
				"date_published": "2022-11-03T14:43:46-04:00",
				"url": "https://banditchronicles.micro.blog/2022/11/03/my-first-microblog.html"
			}
	]
}
